Vulintus/Vulintus_Board_Definitions/hardware/samd/0.1.0/boards.txt
# Upload (with Bootloader)
vulintus_ring_light_v2_0_fab_sam.upload.erase=
vulintus_ring_light_v2_0_fab_sam.upload.maximum_data_size=4096
vulintus_ring_light_v2_0_fab_sam.upload.maximum_size=12288
vulintus_ring_light_v2_0_fab_sam.upload.offset=0x1000
vulintus_ring_light_v2_0_fab_sam.upload.native_usb=true
vulintus_ring_light_v2_0_fab_sam.upload.protocol=sam-ba
vulintus_ring_light_v2_0_fab_sam.upload.tool=Fab_SAM_Arduino:bossac
vulintus_ring_light_v2_0_fab_sam.upload.use_1200bps_touch=true
vulintus_ring_light_v2_0_fab_sam.upload.wait_for_upload_port=true

# Build
# vulintus_ring_light_v2_0_fab_sam.build.board=RING_LIGHT_V2_0
vulintus_ring_light_v2_0_fab_sam.build.board=SAMD_ZERO
vulintus_ring_light_v2_0_fab_sam.build.bootloader_size=__4KB_BOOTLOADER__
vulintus_ring_light_v2_0_fab_sam.build.buildconfig=CONFIG_H_DISABLED
vulintus_ring_light_v2_0_fab_sam.build.cache_flags=-DENABLE_CACHE
vulintus_ring_light_v2_0_fab_sam.build.chip=samd11
vulintus_ring_light_v2_0_fab_sam.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
vulintus_ring_light_v2_0_fab_sam.build.core=fab_sam
vulintus_ring_light_v2_0_fab_sam.build.extra_flags=-D__SAMD11C14A__ {build.usb_flags} -DARM_MATH_CM0PLUS
vulintus_ring_light_v2_0_fab_sam.build.f_cpu=48000000L
vulintus_ring_light_v2_0_fab_sam.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
vulintus_ring_light_v2_0_fab_sam.build.ldscript=linker_scripts/gcc/4KB_Bootloader/flash_16KB.ld
vulintus_ring_light_v2_0_fab_sam.build.mathlib=arm_cortexM0l_math
vulintus_ring_light_v2_0_fab_sam.build.mcu=cortex-m0plus
vulintus_ring_light_v2_0_fab_sam.build.openocdscript=openocd_scripts/ring_light_v2_0_fab_sam.cfg
vulintus_ring_light_v2_0_fab_sam.build.flags.optimize=-Os
vulintus_ring_light_v2_0_fab_sam.build.serialcom_uart=NO_UART
vulintus_ring_light_v2_0_fab_sam.build.serialcom_wire=NO_WIRE
vulintus_ring_light_v2_0_fab_sam.build.serialcom_spi=NO_SPI
vulintus_ring_light_v2_0_fab_sam.build.timerconfig=TIMER_732Hz
vulintus_ring_light_v2_0_fab_sam.build.usb_product="Vulintus Ring Light V2.0"
vulintus_ring_light_v2_0_fab_sam.build.usb_manufacturer="Vulintus Inc"
vulintus_ring_light_v2_0_fab_sam.build.usbcom=CDC_ONLY
vulintus_ring_light_v2_0_fab_sam.build.variant=ring_light_v2_0_fab_sam
vulintus_ring_light_v2_0_fab_sam.build.variant_system_lib=

# Bootloader
vulintus_ring_light_v2_0_fab_sam.bootloader.file=ring_light_v2_0_fab_sam/sam_ba_SAMD11C14A.bin
vulintus_ring_light_v2_0_fab_sam.bootloader.tool=edbg

# Compiler
vulintus_ring_light_v2_0_fab_sam.compiler.c.extra_flags="-I{runtime.tools.CMSIS-4.5.0.path}/CMSIS/Include/" "-I{runtime.tools.CMSIS-Atmel-1.0.0-mattairtech-2.path}/CMSIS/Device/ATMEL/" -D{build.floatconfig} -D{build.timerconfig} -D{build.buildconfig} -D{build.clockconfig} -D{build.usbcom} -D{build.serialcom_uart} -D{build.serialcom_wire} -D{build.serialcom_spi} -D{build.bootloader_size}
vulintus_ring_light_v2_0_fab_sam.compiler.cpp.extra_flags="-I{runtime.tools.CMSIS-4.5.0.path}/CMSIS/Include/" "-I{runtime.tools.CMSIS-Atmel-1.0.0-mattairtech-2.path}/CMSIS/Device/ATMEL/" -D{build.floatconfig} -D{build.timerconfig} -D{build.buildconfig} -D{build.clockconfig} -D{build.usbcom} -D{build.serialcom_uart} -D{build.serialcom_wire} -D{build.serialcom_spi} -D{build.bootloader_size}
vulintus_ring_light_v2_0_fab_sam.compiler.S.extra_flags="-I{runtime.tools.CMSIS-4.5.0.path}/CMSIS/Include/" "-I{runtime.tools.CMSIS-Atmel-1.0.0-mattairtech-2.path}/CMSIS/Device/ATMEL/" -D{build.floatconfig} -D{build.timerconfig} -D{build.buildconfig} -D{build.clockconfig} -D{build.usbcom} -D{build.serialcom_uart} -D{build.serialcom_wire} -D{build.serialcom_spi} -D{build.bootloader_size}


########################################################################################################################